import React from 'react';
import './Blogs.css'
const Blogs = () => {
    return (
        <div>
            <div className='blog'>
                <h1>Sementic Tag</h1>
                <p>Sementic Html tag হল যেগুলি মানুষের এবং মেশিন-পাঠযোগ্য উপায়ে তাদের অর্থ স্পষ্টভাবে বর্ণনা করে।
                header, footer and article tag গুলা সব sementic tag. কারণ তারা উপাদানটির উদ্দেশ্য এবং তাদের ভিতরে থাকা বিষয়বস্তুর ধরন সঠিকভাবে বর্ণনা করে।তারা অন্যান্য উপাদানগুলিকে পৃষ্ঠা বিভাগে একত্রিত করে। এগুলা div tag  দিয়ে ও করা যাই, কিন্তু sementic tag  ব্যবহার করলে পরতে ও বুঝতে সুবিধা হয়।
                </p>
            </div>
            <div className='blog'>
                <h1>Inline</h1>
                <p>একটি Inline element একটি নতুন লাইনে শুরু হয় না এবং এটি শুধুমাত্র প্রয়োজনীয় যতটা প্রস্থ নেয়।</p>
                <h1>Block</h1>
                <p>একটি block element সর্বদা একটি নতুন লাইনে শুরু হয় এবং ব্রাউজারগুলি স্বয়ংক্রিয়ভাবে উপাদানের আগে এবং পরে কিছু স্থান (একটি মার্জিন) যোগ করে।একটি block-level element সর্বদা একটি নতুন লাইনে শুরু হয় এবং ব্রাউজারগুলি স্বয়ংক্রিয়ভাবে উপাদানের আগে এবং পরে কিছু স্থান (একটি মার্জিন) যোগ করে।</p>
                <h1>Inline Block</h1>
                <p>
                Inline-Block এটি Inline উপাদানের মতো Formatted করা হয়েছে, যেখানে এটি একটি নতুন লাইনে শুরু হয় না। কিন্তু, আপনি প্রস্থ এবং উচ্চতা মান সেট করতে পারেন। Block উপাদানটি একটি নতুন লাইনে শুরু হবে এবং উপলব্ধ পুরো প্রস্থটি দখল করবে।
                </p>
            </div>
            
        </div>
    );
};

export default Blogs;